# March Madness! #

In [7]:
# import libs
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns
import sqlite3

In [12]:
# import sql file
# reference: http://www.datacarpentry.org/python-ecology/08-working-with-sql

con = sqlite3.connect("database.sqlite")
df = pd.read_sql("SELECT table_name FROM *", con)

DatabaseError: Execution failed on sql 'SELECT table_name FROM database': no such table: database

In [11]:
df

     Team_Id        Team_Name
0       1101      Abilene Chr
1       1102        Air Force
2       1103            Akron
3       1104          Alabama
4       1105      Alabama A&M
5       1106       Alabama St
6       1107        Albany NY
7       1108        Alcorn St
8       1109     Alliant Intl
9       1110    American Univ
10      1111   Appalachian St
11      1112          Arizona
12      1113       Arizona St
13      1114  Ark Little Rock
14      1115   Ark Pine Bluff
15      1116         Arkansas
16      1117      Arkansas St
17      1118     Armstrong St
18      1119             Army
19      1120           Auburn
20      1121          Augusta
21      1122      Austin Peay
22      1123          Ball St
23      1124           Baylor
24      1125          Belmont
25      1126  Bethune-Cookman
26      1127       Binghamton
27      1128    Birmingham So
28      1129         Boise St
29      1130   Boston College
..       ...              ...
334     1435       Vanderbilt
335     1436          Vermont
336     1437        Villanova
337     1438         Virginia
338     1439    Virginia Tech
339     1440              VMI
340     1441       W Carolina
341     1442       W Illinois
342     1443              WKU
343     1444       W Michigan
344     1445       W Salem St
345     1446      W Texas A&M
346     1447           Wagner
347     1448      Wake Forest
348     1449       Washington
349     1450    Washington St
350     1451         Weber St
351     1452    West Virginia
352     1453     WI Green Bay
353     1454     WI Milwaukee
354     1455       Wichita St
355     1456   William & Mary
356     1457         Winthrop
357     1458        Wisconsin
358     1459          Wofford
359     1460        Wright St
360     1461          Wyoming
361     1462           Xavier
362     1463             Yale
363     1464    Youngstown St

[364 rows x 2 columns]